<?php
echo "Задача для первого блока
Вариант 5
Написать программу для игры Сапер (minesweeper). Квадратное игровое поле разделено на смежные ячейки, некоторые из которых заминированы; количество заминированных ячеек известно. Цель игры - открытие всех ячеек, не содержащих мины.
Игрок открывает ячейки, стараясь не открыть ячейку с миной. Открыв ячейку с миной, он проигрывает. Если под открытой ячейкой мины нет, то в ней появляется число, показывающее, сколько ячеек, соседствующих с только что открытой, заминировано.Если под соседними ячейками тоже нет мин, то открывается не заминированная область до ячеек, в которых есть цифры.
";
?>